src/Test 45 Request.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing"
    xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Header>
        <a:Action s:mustUnderstand="1">urn:ihe:iti:2007:RetrieveDocumentSet</a:Action>
        <h:PCEHRHeader
            xmlns="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0"
            xmlns:xsd="http://www.w3.org/2001/XMLSchema"
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
            xmlns:h="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0"
            xml:id="header-e7d45594-939e-43ef-8f72-4041d08b8368">
            <User>
                <IDType>HPII</IDType>
                <ID>8003611566713495</ID>
                <userName>Mr Philip James Farman II</userName>
                <useRoleForAudit>false</useRoleForAudit>
            </User>
            <ihiNumber>8003608166980672</ihiNumber>
            <productType>
                <vendor>StrongRoom AI</vendor>
                <productName>StrongCare</productName>
                <productVersion>1.0</productVersion>
                <platform>CSP</platform>
            </productType>
            <clientSystemType>CSP</clientSystemType>
            <accessingOrganisation>
                <organisationID>8003623233372670</organisationID>
                <organisationName>Strong Room</organisationName>
            </accessingOrganisation>
        </h:PCEHRHeader>
        <h:signature
            xmlns="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0"
            xmlns:h="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0">
            <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
                <SignedInfo>
                    <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
                    <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
                    <Reference URI="#body-b17b74d5-15c3-4330-aadd-d68f2eeb9d05">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
                        <DigestValue>aiuuAVjnNQ9ebpc0MG+oRZ4LTy4=</DigestValue>
                    </Reference>
                    <Reference URI="#header-e7d45594-939e-43ef-8f72-4041d08b8368">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
                        <DigestValue>F7CExH0mUoGDj71V1AVWcXwoLmI=</DigestValue>
                    </Reference>
                    <Reference URI="#timestamp-f34cfcd3-c404-4bd9-accd-8e65dec25fd2">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
                        <DigestValue>EjhYaYjmRu97q0z0MYNgknLcRoY=</DigestValue>
                    </Reference>
                </SignedInfo>
                <SignatureValue>
                    G1dVSf9q87AIaMUi00HjCqiOkEpI4DSQnRp9mQAcoHYZw9bgSyAHtyZjcmQAuGd1DyN+iRgfJd49Mtqf+rKR0rCqU/2uQgsXpLnRF5u8L+luTAJita5RLnBKZ93+9/vtL7qtAQJC6obeZxNVNHsl0eyeZJcowcYt/Zs5ldm2nhyBMMvA7GJvpsfK/RPOlbCw3RjjJDU9A+706PaX8cHZCgLmkEwWdnVivjxJj1oct/F+pL+k9pVYftCT6o6p8UJtMnyNZsvPfsl3QyYwMGoXKPN7/Kulu6tFIIs6X8aP8e+ds6UoQNq1L8RnvbM6rs47BPxy3vensZos/B0YsfZR0Q==</SignatureValue>
                <KeyInfo>
                    <X509Data>
                        <X509Certificate>MIIGkDCCBXigAwIBAgICOyQwDQYJKoZIhvcNAQELBQAwejELMAkGA1UEBhMCQVUx
                            DDAKBgNVBAoTA0dPVjEWMBQGA1UECxMNSHVtYW5zZXJ2aWNlczFFMEMGA1UEAxM8
                            VGVzdCBNZWRpY2FyZSBBdXN0cmFsaWEgT3JnYW5pc2F0aW9uIENlcnRpZmljYXRp
                            b24gQXV0aG9yaXR5MB4XDTIzMDgyODAxMjIwN1oXDTI1MDgyODAxMjIwN1owgdIx
                            EjAQBgoJkiaJk/IsZAEZFgJhdTETMBEGCgmSJomT8ixkARkWA25ldDEgMB4GCgmS
                            JomT8ixkARkWEGVsZWN0cm9uaWNoZWFsdGgxEjAQBgoJkiaJk/IsZAEZFgJpZDEg
                            MB4GCgmSJomT8ixkARkWEDgwMDM2MzMyMzMzNjkxNzAxETAPBgNVBAoTCENTUDEw
                            MzMxMTwwOgYDVQQDEzNnZW5lcmFsLjgwMDM2MzMyMzMzNjkxNzAuaWQuZWxlY3Ry
                            b25pY2hlYWx0aC5uZXQuYXUwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
                            AQDLFvV7W5/zH/VEcYNGDCJQM0ZFwOIioDCaSb4tteJIRw9ag12HLogFozYXpJ/c
                            87JlM9x7Xms4sPp9RH5Ln5nZ/H4V2bcH8AurquEoZG2sVJLMltCLvhgkw0ZhDNe0
                            2KSrGUqLSlFvtRswyMSe3CCRRGUJiNlmpkphVTs7ZEx8EZU1036BjK3kMktEy5a1
                            HfyoUrXVApZ4W2SpiUKl4pNU7kSXSAD375WyHmdHKbLOU3zvVnfiNBY6+mAJLEwU
                            IF+uQf1jP0+fqWoUrWGEu0c0UzHSNi4iEYotZ4WQkj93tW1jE1Nh6f9LGX1ZeC2q
                            H6V01L5FWoEhAfDTVM8pz/zTAgMBAAGjggLFMIICwTAMBgNVHRMBAf8EAjAAME8G
                            CCsGAQUFBwEBBEMwQTA/BggrBgEFBQcwAYYzaHR0cDovL29jc3AuY2VydGlmaWNh
                            dGVzLWF1c3RyYWxpYS5jb20uYXUvbWFvY2EucGt4MIIBHAYDVR0gBIIBEzCCAQ8w
                            ggELBgoqJNL+gHcBFgEBMIH8MIHLBggrBgEFBQcCAjCBvhqBu0NlcnRpZmljYXRl
                            cyBpc3N1ZWQgdW5kZXIgdGhpcyBDUCBtdXN0IG9ubHkgYmUgcmVsaWVkIG9uIGJ5
                            IGVudGl0aWVzIHdpdGhpbiB0aGUgQ29tbXVuaXR5IG9mIEludGVyZXN0LCB1bmxl
                            c3Mgb3RoZXJ3aXNlIGFncmVlZCwgYW5kIG5vdCBmb3IgcHVycG9zZXMgb3RoZXIg
                            dGhhbiB0aG9zZSBwZXJtaXR0ZWQgYnkgdGhpcyBDUC4wLAYIKwYBBQUHAgEWIGh0
                            dHA6Ly93d3cuaHVtYW5zZXJ2aWNlcy5nb3YuYXUvMBkGCSoko5CVFwHOGQQMFgo5
                            MTg1MjgzNTk2MA4GA1UdDwEB/wQEAwIEsDATBgNVHSUEDDAKBggrBgEFBQcDAjCB
                            nAYDVR0jBIGUMIGRgBSvYN51YctPajChNpNGTWUzAIit7qF2pHQwcjELMAkGA1UE
                            BhMCQVUxDDAKBgNVBAoTA0dPVjEWMBQGA1UECxMNSHVtYW5zZXJ2aWNlczE9MDsG
                            A1UEAxM0VGVzdCBNZWRpY2FyZSBBdXN0cmFsaWEgUm9vdCBDZXJ0aWZpY2F0aW9u
                            IEF1dGhvcml0eYIBBDBOBgNVHR8ERzBFMEOgQaA/hj1odHRwOi8vbWF0ZXN0LmNl
                            cnRpZmljYXRlcy1hdXN0cmFsaWEuY29tLmF1L01BT0NBMi9sYXRlc3QuY3JsMBEG
                            A1UdDgQKBAhA1qgYBrJOrjANBgkqhkiG9w0BAQsFAAOCAQEAyojZ9t1wy3u0Z1Sg
                            kwPesMuaPKxibVoSHZ9GyffnBfu76Ed6/7UJUmUBF/pReEa8vDysGZuR5V9AaiGm
                            XQNMmGOq+HsMlbOy6TEUb/LKJeIBfPgXPKsUKqdw0pSOM66emmbIypQTZVthiVQA
                            Ia6NEpq/dbFSusgrWO0EhwrvsBo/QjxazfcX2qpCLzDCKYy2kGpLamVHHxsonC6W
                            NWEmG4ib2cwDfcvjX4mGWZag6ZBed9/1RKsKCmylFs2mv3CX/7VZ25y90bbe5nmq
                            em6gGh41/aHL4qG86NEqPseHtfjKmylY0K42Oe7ul8bVxX9+9m2DXqlfb9Dlq26U
                            39Qb8Q==
                        </X509Certificate>
                    </X509Data>
                </KeyInfo>
            </Signature>
        </h:signature>
        <h:timestamp
            xmlns="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0"
            xmlns:h="http://ns.electronichealth.net.au/pcehr/xsd/common/CommonCoreElements/1.0"
            xml:id="timestamp-f34cfcd3-c404-4bd9-accd-8e65dec25fd2">
            <created>2024-04-16T11:35:57+10:00</created>
        </h:timestamp>
        <a:MessageID>urn:uuid:c6986a84-150e-4320-839c-159a7ef603cf</a:MessageID>
        <a:ReplyTo>
            <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
        </a:ReplyTo>
        <a:From>
            <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
        </a:From>
        <a:To s:mustUnderstand="1">http://www.w3.org/2005/08/addressing/anonymous</a:To>
    </s:Header>
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xml:id="body-b17b74d5-15c3-4330-aadd-d68f2eeb9d05">
        <RetrieveDocumentSetRequest xmlns="urn:ihe:iti:xds-b:2007">
            <DocumentRequest>
                <RepositoryUniqueId>1.2.36.1.2001.1007.10.8003640002000050</RepositoryUniqueId>
                <DocumentUniqueId>1.2.36.2250765283.8173.17322.48409.205351618934179</DocumentUniqueId>
            </DocumentRequest>
        </RetrieveDocumentSetRequest>
    </s:Body>
</s:Envelope>